In [1]:
import pandas as pd
import numpy as np
ar=np.array([10,11,12,13])
df=pd.DataFrame(ar)
print(df)

0
0  10
1  11
2  12
3  13

In [1]:
import pandas as pd
r=[1,2,3,4,5]
n=["ayush",'vaibhav','pranshi','rishita','sanchit']
m=[50,46,75,51,85]
d={'rno':r,'name':n,'marks':m}
df=pd.DataFrame(d)
print(df)
print(df['name'])
marks=df['marks']
print(marks)

   rno     name  marks
0    1    ayush     50
1    2  vaibhav     46
2    3  pranshi     75
3    4  rishita     51
4    5  sanchit     85
0      ayush
1    vaibhav
2    pranshi
3    rishita
4    sanchit
Name: name, dtype: object
0    50
1    46
2    75
3    51
4    85
Name: marks, dtype: int64

In [2]:
df['name']=='rishita'

0    False
1    False
2    False
3     True
4    False
Name: name, dtype: bool

In [2]:
df.shape

(5, 3)

In [22]:
#DATAFRAME ATTRIBUTES such as index, values, columns, axes, dtpes, size, shape, empty, T
df.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
df.columns

Index(['rno', 'name', 'marks'], dtype='object')

In [3]:
df.values

array([[1, 'ayush', 50],
       [2, 'vaibhav', 46],
       [3, 'pranshi', 75],
       [4, 'rishita', 51],
       [5, 'sanchit', 85]], dtype=object)

In [26]:
df.axes

[RangeIndex(start=0, stop=5, step=1),
 Index(['rno', 'name', 'marks'], dtype='object')]

In [27]:
df.dtypes

rno       int64
name     object
marks     int64
dtype: object

In [29]:
df.size

15

In [30]:
df.empty

False

In [33]:
len(df)

5

In [34]:
df.count()

rno      5
name     5
marks    5
dtype: int64

In [35]:
df.count(axis='columns')

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [36]:
df.count(axis='rows')

rno      5
name     5
marks    5
dtype: int64

In [37]:
df.T #T means transpose means convert columns into rows

           0        1        2        3        4
rno        1        2        3        4        5
name   ayush  vaibhav  pranshi  rishita  sanchit
marks     50       46       75       51       85

In [39]:
df.values

array([[1, 'ayush', 50],
       [2, 'vaibhav', 46],
       [3, 'pranshi', 75],
       [4, 'rishita', 51],
       [5, 'sanchit', 85]], dtype=object)

In [50]:
#ACCESSING COLUMN VALUES
df['name']

0      ayush
1    vaibhav
2    pranshi
3    rishita
4    sanchit
Name: name, dtype: object

In [11]:
df['marks']

0    50
1    46
2    75
3    51
4    85
Name: marks, dtype: int64

In [4]:
df[['rno','name']] #take care of syntax here

   rno     name
0    1    ayush
1    2  vaibhav
2    3  pranshi
3    4  rishita
4    5  sanchit

In [57]:
df[['name','rno','marks']]

      name  rno  marks
0    ayush    1     50
1  vaibhav    2     46
2  pranshi    3     75
3  rishita    4     51
4  sanchit    5     85

In [4]:
string="informatics practices"
string[:]
string[6:15]

'atics pra'

In [3]:
df.iloc[1,3:]

Series([], Name: 1, dtype: object)

In [4]:
df.iloc[1:3,:]

   rno     name  marks
1    2  vaibhav     46
2    3  pranshi     75

In [63]:
df[1:3]

   rno     name  marks
1    2  vaibhav     46
2    3  pranshi     75

In [66]:
df[1:4]

   rno     name  marks
1    2  vaibhav     46
2    3  pranshi     75
3    4  rishita     51

In [69]:
#ADDING NEW COLUMNS IN DATAFRAME
df['mobile']='9873145385'
df

   rno     name  marks  vaibhav      mobile
0    1    ayush     50      460  9873145385
1    2  vaibhav     46      460  9873145385
2    3  pranshi     75      460  9873145385
3    4  rishita     51      460  9873145385
4    5  sanchit     85      460  9873145385

In [3]:
import pandas as pd
r=[1,2,3,4,5]
n=["ayush",'vaibhav','pranshi','rishita','sanchit']
m=[50,46,75,51,85]
d={'rno':r,'name':n,'marks':m}
df=pd.DataFrame(d,index=[x for x in range(5)])
print(df)
df.at['ayush',:]=1200
df
df.at[4,:]=50,'sanchit singhal',95
df
df.at['sanchit',:]=60,'ss',100

rno     name  marks
0    1    ayush     50
1    2  vaibhav     46
2    3  pranshi     75
3    4  rishita     51
4    5  sanchit     85

In [6]:
df
nam=input("Enter a name to search")
df.loc[df['name']==nam]

Empty DataFrame
Columns: [rno, name, marks]
Index: []

In [6]:
#DELETING A COLUMN
df
#del df['mobile']
del df['name']

   rno     name
0    1    ayush
1    2  vaibhav
2    3  pranshi
3    4  rishita
4    5  sanchit

In [8]:
#DELETING A ROW
df.drop(range(2,4))

   rno     name
0    1    ayush
1    2  vaibhav
4    5  sanchit

          rno     name   marks      mobile
0         1.0    ayush    50.0  9873145385
1         2.0  vaibhav    46.0  9873145385
2         3.0  pranshi    75.0  9873145385
3         4.0  rishita    51.0  9873145385
4         5.0  sanchit    85.0  9873145385
kanha  1200.0     1200  1200.0        1200
5         6.0     rama    99.0    99999999

In [93]:
#iterating means looping/reading rows and columns
for(row,rowSeries) in df.iterrows():
    print(row)

0
1
2
3
4
kanha
5

In [2]:
import pandas as pd
disales={2015:{'qtr1':34500,'qtr2':56000,'qtr3':47000,'qtr4':49000},\
2016:{'qtr1':24500,'qtr2':46000,'qtr3':37000,'qtr4':39000},\
2017:{'qtr1':14500,'qtr2':36000,'qtr3':27000,'qtr4':39000}}

df=pd.DataFrame(disales)

for(row,rowSeries) in df.iterrows():
    print(row)
    i=0
    for val in rowSeries:
        print('At',i,'position',val)
        i=i+1

qtr1
At 0 position 34500
At 1 position 24500
At 2 position 14500
qtr2
At 0 position 56000
At 1 position 46000
At 2 position 36000
qtr3
At 0 position 47000
At 1 position 37000
At 2 position 27000
qtr4
At 0 position 49000
At 1 position 39000
At 2 position 39000

In [10]:
import pandas as pd
disales={2015:{'qtr1':34500,'qtr2':56000,'qtr3':47000,'qtr4':49000},\
2016:{'qtr1':24500,'qtr2':46000,'qtr3':37000,'qtr4':39000},\
2017:{'qtr1':14500,'qtr2':36000,'qtr3':27000,'qtr4':39000}}

df=pd.DataFrame(disales)
df
for(row,rowSeries) in df.iterrows():
    print(row)
    i=0
    for val in rowSeries:
        print(val,end=" ")
        i=i+1 
    print()

qtr1
34500 24500 14500
qtr2
56000 46000 36000
qtr3
47000 37000 27000
qtr4
49000 39000 39000

In [12]:
import pandas as pd
disales={2015:{'qtr1':34500,'qtr2':56000,'qtr3':47000,'qtr4':49000},\
2016:{'qtr1':24500,'qtr2':46000,'qtr3':37000,'qtr4':39000},\
2017:{'qtr1':14500,'qtr2':36000,'qtr3':27000,'qtr4':39000}}

df=pd.DataFrame(disales)

for(col,colSeries) in df.iteritems():
    print(col)
    i=0
    for val in colSeries:
        print('At',i,'position',val)
        i=i+1

2015
At 0 position 34500
At 1 position 56000
At 2 position 47000
At 3 position 49000
2016
At 0 position 24500
At 1 position 46000
At 2 position 37000
At 3 position 39000
2017
At 0 position 14500
At 1 position 36000
At 2 position 27000
At 3 position 39000

In [117]:
df1=df
print(df1)

2015   2016   2017
qtr1  34500  24500  14500
qtr2  56000  46000  36000
qtr3  47000  37000  27000
qtr4  49000  39000  39000

In [118]:
print(df)

2015   2016   2017
qtr1  34500  24500  14500
qtr2  56000  46000  36000
qtr3  47000  37000  27000
qtr4  49000  39000  39000

In [119]:
df3=df+df1
print(df3)

2015   2016   2017
qtr1   69000  49000  29000
qtr2  112000  92000  72000
qtr3   94000  74000  54000
qtr4   98000  78000  78000

In [120]:
print(df3-df)

2015   2016   2017
qtr1  34500  24500  14500
qtr2  56000  46000  36000
qtr3  47000  37000  27000
qtr4  49000  39000  39000

In [45]:
import pandas as pd 
n=[101,102,103,104,105]
nam=['aman','arpit','karan','sharan','ishita']
mob=[1234567890,9912345678,5678912345,5555544444,8888444422]
em=['aman@gmail.com','arpit@gmail.com','karan@gmail.com','sharan@gmail.com','ishita@iim.com']
stu={'rno':n,'name':nam,'mobile':mob,'email':em}
df=pd.DataFrame(stu)
df
df['city']='Delhi'
df.loc[df['rno']==102,'city']='Mumbai'
df
df.loc[(df['rno']==104) & (df['name']=='sharan'),'city']='Kochin'
df
df.loc[df['rno']>104,'city']='Lucknow'
df
dftmp=df
dftmp
import numpy as np 
dftmp['country']=np.NaN
del dftmp['email']
dftmp.loc[5]=[107,'shravan',9999299520,'Kanpur','India']
dftmp.drop(3)
dftmp

   rno     name      mobile     city country
0  101     aman  1234567890    Delhi     NaN
1  102    arpit  9912345678   Mumbai     NaN
2  103    karan  5678912345    Delhi     NaN
3  104   sharan  5555544444   Kochin     NaN
4  105   ishita  8888444422  Lucknow     NaN
5  107  shravan  9999299520   Kanpur   India

In [46]:
dftmp

   rno     name      mobile     city country
0  101     aman  1234567890    Delhi     NaN
1  102    arpit  9912345678   Mumbai     NaN
2  103    karan  5678912345    Delhi     NaN
3  104   sharan  5555544444   Kochin     NaN
4  105   ishita  8888444422  Lucknow     NaN
5  107  shravan  9999299520   Kanpur   India

In [47]:
dftmp.drop(1)

   rno     name      mobile     city country
0  101     aman  1234567890    Delhi     NaN
2  103    karan  5678912345    Delhi     NaN
3  104   sharan  5555544444   Kochin     NaN
4  105   ishita  8888444422  Lucknow     NaN
5  107  shravan  9999299520   Kanpur   India

In [52]:
dftmp.isnull
dftmp.fillna(999)

   rno     name      mobile     city country
0  101     aman  1234567890    Delhi     999
1  102    arpit  9912345678   Mumbai     999
2  103    karan  5678912345    Delhi     999
3  104   sharan  5555544444   Kochin     999
4  105   ishita  8888444422  Lucknow     999
5  107  shravan  9999299520   Kanpur   India

In [67]:
c1=[10,np.NaN,30,np.NaN,50]
c2=[np.NaN,20,np.NaN,40,np.NaN]
df1=pd.DataFrame(c1)
df2=pd.DataFrame(c2)
print(df1)
print(df2)
df2.combine_first(df1)
print(df2)
df1.combine_first(df2)
print(pd.concat([df1,df2],ignore_index=True))

0
0  10.0
1   NaN
2  30.0
3   NaN
4  50.0
      0
0   NaN
1  20.0
2   NaN
3  40.0
4   NaN
      0
0   NaN
1  20.0
2   NaN
3  40.0
4   NaN
      0
0  10.0
1   NaN
2  30.0
3   NaN
4  50.0
5   NaN
6  20.0
7   NaN
8  40.0
9   NaN

In [14]:
import pandas as pd
r=[1,2,3,4,5]
n=["ayush",'vaibhav','pranshi','rishita','sanchit']
m=[50,46,75,51,85]
d={'rno':r,'name':n,'marks':m}
df=pd.DataFrame(d,index=[x for x in range(5)])
print(df)
s1=pd.Series(df['name'])
print(s1)
s2=pd.Series(df['rno'])
print(s2)
s3=pd.Series(df['marks'])
print(s3)

print(df.head(2))

rno     name  marks
0    1    ayush     50
1    2  vaibhav     46
2    3  pranshi     75
3    4  rishita     51
4    5  sanchit     85
0      ayush
1    vaibhav
2    pranshi
3    rishita
4    sanchit
Name: name, dtype: object
0    1
1    2
2    3
3    4
4    5
Name: rno, dtype: int64
0    50
1    46
2    75
3    51
4    85
Name: marks, dtype: int64
   rno     name  marks
0    1    ayush     50
1    2  vaibhav     46

In [1]:
import pandas as pd 
r=[1,2,3,4,5,6]
n=['Prerna Singh','Manish Arora','Tanish Goel','Falguni Jain', 'Kanika Bhatnagar', 'Ramandeep Kaur']
u1=[24,18,20,22,15,20]
u2=[24,17,22,20,20,15]
u3=[20,19,18,24,18,22]
u4=[22,22,24,20,22,24]
d={'rollno':r,'name':n,'ut1':u1,'ut2':u2,'ut3':u3,'ut4':u4}
df=pd.DataFrame(d)
print(df)

   rollno              name  ut1  ut2  ut3  ut4
0       1      Prerna Singh   24   24   20   22
1       2      Manish Arora   18   17   19   22
2       3       Tanish Goel   20   22   18   24
3       4      Falguni Jain   22   20   24   20
4       5  Kanika Bhatnagar   15   20   18   22
5       6    Ramandeep Kaur   20   15   22   24

In [12]:
print(df.max(axis=0))

rollno              6
name      Tanish Goel
ut1                24
ut2                24
ut3                24
ut4                24
dtype: object

In [10]:
print(df.max())

rollno              6
name      Tanish Goel
ut1                24
ut2                24
ut3                24
ut4                24
dtype: object

In [11]:
print(df.max(axis=1))

0    24
1    22
2    24
3    24
4    22
5    24
dtype: int64

In [2]:
#Answer of Q.No.22 ii)
df1=df[df['rollno']==4]
print(df1)

   rollno          name  ut1  ut2  ut3  ut4
3       4  Falguni Jain   22   20   24   20

In [6]:
df1=df[df.rollno==4]
print(df1)

   rollno          name  ut1  ut2  ut3  ut4
3       4  Falguni Jain   22   20   24   20

In [13]:
#answer Q.No.22 part iii
print(df.count())

rollno    6
name      6
ut1       6
ut2       6
ut3       6
ut4       6
dtype: int64

In [17]:
print(df.columns)

Index(['rollno', 'name', 'ut1', 'ut2', 'ut3', 'ut4'], dtype='object')

In [21]:
df['grade']=['A','B','A','A','B','A']
print(df)

   rollno              name  ut1  ut2  ut3  ut4 grade
0       1      Prerna Singh   24   24   20   22     A
1       2      Manish Arora   18   17   19   22     B
2       3       Tanish Goel   20   22   18   24     A
3       4      Falguni Jain   22   20   24   20     A
4       5  Kanika Bhatnagar   15   20   18   22     B
5       6    Ramandeep Kaur   20   15   22   24     A

   rollno              name  ut1  ut2  ut3  ut4 grade
0       1      Prerna Singh   24   24   20   22     A
1       2      Manish Arora   18   17   19   22     B
2       3       Tanish Goel   20   22   18   24     A
3       4      Falguni Jain   22   20   24   20     A
4       5  Kanika Bhatnagar   15   20   18   22     B
5       6    Ramandeep Kaur   20   15   22   24     A

In [5]:
import pandas as pd 
r=[1,2,3,4,5,6]
n=['Prerna Singh','Manish Arora','Tanish Goel','Falguni Jain', 'Kanika Bhatnagar', 'Ramandeep Kaur']
u1=[24,18,20,22,15,20]
u2=[24,17,22,20,20,15]
u3=[20,19,18,24,18,22]
u4=[22,22,24,20,22,24]
d={'rollno':r,'name':n,'ut1':u1,'ut2':u2,'ut3':u3,'ut4':u4}
df=pd.DataFrame(d)
print(df)
df["Total"]=df["ut1"]+df["ut2"]+df["ut3"]+df["ut4"]
print(df)

   rollno              name  ut1  ut2  ut3  ut4
0       1      Prerna Singh   24   24   20   22
1       2      Manish Arora   18   17   19   22
2       3       Tanish Goel   20   22   18   24
3       4      Falguni Jain   22   20   24   20
4       5  Kanika Bhatnagar   15   20   18   22
5       6    Ramandeep Kaur   20   15   22   24
   rollno              name  ut1  ut2  ut3  ut4  Total
0       1      Prerna Singh   24   24   20   22     90
1       2      Manish Arora   18   17   19   22     76
2       3       Tanish Goel   20   22   18   24     84
3       4      Falguni Jain   22   20   24   20     86
4       5  Kanika Bhatnagar   15   20   18   22     75
5       6    Ramandeep Kaur   20   15   22   24     81

In [30]:
import pandas as pd
f=['Apple','Apple','Pear','Pear','Lime']
c=['Red','Green','Red','Green','Green']
cn=[3,9,25,26,99]
p=[120,110,125,150,70]
d={'fruits':f,'color':c,'count':cn,'price':p}
df=pd.DataFrame(d)
df
df.min()
df[df['count']>25]
df.iloc[[1,3,4]]
bk=df
bk['count']=bk['count']+100
df=df.drop(['color','count'],axis=1)
print(bk)
print(df)
df['sold']=[2,3, 4, 8,16]
df

  fruits  color  count  price
0  Apple    Red    103    120
1  Apple  Green    109    110
2   Pear    Red    125    125
3   Pear  Green    126    150
4   Lime  Green    199     70
  fruits  price
0  Apple    120
1  Apple    110
2   Pear    125
3   Pear    150
4   Lime     70

  fruits  price  sold
0  Apple    120     2
1  Apple    110     3
2   Pear    125     4
3   Pear    150     8
4   Lime     70    16